app/views/books/_form.html.erb

    <%= f.input :title %>
    <%= f.input :category_id, :collection => Category.all, :label_method => :name, :id_method => :id %>
---
SELECT "categories".* FROM "categories"