app/views/books/_item.html.erb

    <div class="book-rating">
      <%= stars book.reviews.map(&:rating).average %><span><%= book.reviews.count %></span>
---
SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."book_id" = ?  ORDER BY "book_reviews"."created_at" DESC  [["book_id", 1]]
SELECT COUNT(*) FROM "book_reviews" WHERE "book_reviews"."book_id" = ?  [["book_id", 1]]