[{ "category": "Action and Adventure", "title" : "The Hunger Games", "author" : "Suzanne Collins", "year" : "2008", "image" :"http://ecx.images-amazon.com/images/I/41bOj-am1RL._SX331_BO1,204,203,200_.jpg", "pages" : "384", "description" : "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. Long ago the districts waged war on the Capitol and were defeated. As part of the surrender terms, each district agreed to send one boy and one girl to appear in an annual televised event called The Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she is forced to represent her district in the Games. The terrain, rules, and level of audience participation may change but one thing is constant: kill or be killed." },
{ "category": "Science Fiction", "title" : "The Martian", "author" : "Andy Weir", "year" : "2014", "image" : "http://ecx.images-amazon.com/images/I/41-YkFaghDL._SX302_BO1,204,203,200_.jpg", "pages" : "384", "description" : "Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. Now, he's sure he'll be the first person to die there. After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive—and even if he could get word out, his supplies would be gone long before a rescue could arrive. Chances are, though, he won't have time to starve to death. The damaged machinery, unforgiving environment, or plain-old human error are much more likely to kill him first. But Mark isn't ready to give up yet. Drawing on his ingenuity, his engineering skills—and a relentless, dogged refusal to quit—he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?" },
{ "category": "History", "title" : "The Right Stuff", "author" : "Tom Wolfe", "year" : "1979", "image" :"http://ecx.images-amazon.com/images/I/51ZgqYqwuAL._SX322_BO1,204,203,200_.jpg", "pages" : "448", "description" : "From 'America's nerviest journalist' (Newsweek)--a breath-taking epic, a magnificent adventure story, and an investigation into the true heroism and courage of the first Americans to conquer space. 'Tom Wolfe at his very best' (The New York Times Book Review)" },
{ "category": "Biography", "title" : "Steve Jobs", "author" : "Walter Isaacson", "year" : "2011", "image" : "http://ecx.images-amazon.com/images/I/41dKkez-1rL._SX326_BO1,204,203,200_.jpg", "pages" : "656", "description" : "Based on more than forty interviews with Jobs conducted over two years—as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues—Walter Isaacson has written a riveting story of the roller-coaster life and searingly intense personality of a creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing. At a time when America is seeking ways to sustain its innovative edge, and when societies around the world are trying to build digital-age economies, Jobs stands as the ultimate icon of inventiveness and applied imagination. He knew that the best way to create value in the twenty-first century was to connect creativity with technology. He built a company where leaps of the imagination were combined with remarkable feats of engineering. Although Jobs cooperated with this book, he asked for no control over what was written nor even the right to read it before it was published. He put nothing off-limits. He encouraged the people he knew to speak honestly. And Jobs speaks candidly, sometimes brutally so, about the people he worked with and competed against. His friends, foes, and colleagues provide an unvarnished view of the passions, perfectionism, obsessions, artistry, devilry, and compulsion for control that shaped his approach to business and the innovative products that resulted. Driven by demons, Jobs could drive those around him to fury and despair. But his personality and products were interrelated, just as Apple’s hardware and software tended to be, as if part of an integrated system. His tale is instructive and cautionary, filled with lessons about innovation, character, leadership, and values." },
{ "category": "Business", "title" : "The Big Short: Inside the Doomsday Machine", "author" : "Michael Lewis", "year" : "2010", "image" : "http://ecx.images-amazon.com/images/I/51u30uvjFaL._SX333_BO1,204,203,200_.jpg", "pages" : "288", "description" : "The real story of the crash began in bizarre feeder markets where the sun doesn't shine and the SEC doesn't dare, or bother, to tread: the bond and real estate derivative markets where geeks invent impenetrable securities to profit from the misery of lower--and middle--class Americans who can't pay their debts. The smart people who understood what was or might be happening were paralyzed by hope and fear; in any case, they weren't talking. Michael Lewis creates a fresh, character-driven narrative brimming with indignation and dark humor, a fitting sequel to his #1 bestseller Liar's Poker. Out of a handful of unlikely--really unlikely--heroes, Lewis fashions a story as compelling and unusual as any of his earlier bestsellers, proving yet again that he is the finest and funniest chronicler of our time." },
{ "category": "Fantasy", "title" : "Harry Potter and the Sorceror's Stone", "author" : "J.K. Rowling", "year" : "1998", "image" : "http://ecx.images-amazon.com/images/I/51MU5VilKpL._SX338_BO1,204,203,200_.jpg", "pages" : "309", "description" : "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright. From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny." }]
