app/controllers/astronauts_controller.rb

  def update
    astronaut = Astronaut.find_by(:id => params["id"])
    astronaut.name = params[:name]
    astronaut.save
---
SELECT  "astronauts".* FROM "astronauts" WHERE "astronauts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "astronauts" SET "name" = ? WHERE "astronauts"."id" = ?  [["name", "Neil Armstron"], ["id", 3]]

  def edit
    @astronaut = Astronaut.find_by(:id => params["id"])
---
SELECT  "astronauts".* FROM "astronauts" WHERE "astronauts"."id" = ? LIMIT 1  [["id", 3]]

  def index
  	@astronauts = Astronaut.all
---
SELECT "astronauts".* FROM "astronauts"

  def create
    @astronaut = Astronaut.new
    @astronaut.name = params["name"]
    if @astronaut.save
---
INSERT INTO "astronauts" ("name") VALUES (?)  [["name", "Bryce Cunningham"]]

  def destroy
    @astronaut = Astronaut.find_by(:id => params["id"])
    @astronaut.delete
---
SELECT  "astronauts".* FROM "astronauts" WHERE "astronauts"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "astronauts" WHERE "astronauts"."id" = ?  [["id", 5]]

  def show
    @astronaut = Astronaut.find_by(:id => params["id"])
---
SELECT  "astronauts".* FROM "astronauts" WHERE "astronauts"."id" = ? LIMIT 1  [["id", 3]]