app/controllers/book_reviews_controller.rb

  def create
    @book_review = @book.reviews.build(book_review_params)
    @book_review.user_id = current_user.id
    @saved = @book_review.save
---
INSERT INTO "book_reviews" ("rating", "description", "book_id", "user_id", "created_at") VALUES (?, ?, ?, ?, ?)  [["rating", 3], ["description", "pretty good"], ["book_id", 4], ["user_id", 1], ["created_at", "2015-08-26 03:56:59.254254"]]