app/controllers/books_controller.rb

  def index
    @books = Book.page params[:page]
---
SELECT COUNT(*) FROM "books"

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "category_id", "description", "author", "year", "pages") VALUES (?, ?, ?, ?, ?, ?)  [["title", "adlg"], ["category_id", 3], ["description", "alksdf"], ["author", "asdfk"], ["year", "1987"], ["pages", "300"]]

  def destroy
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 7]]