app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    raise ActiveRecord::RecordNotFound unless @category
    @books = @category.books.page params[:page]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "books" WHERE "books"."category_id" = ?  [["category_id", 1]]